#### UITheme Enumeration

---

|  |
| --- |
| See Also |

The application frame theme.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum UITheme ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration UITheme ``` |

| Visual C++ |
| --- |
| ``` public enum class UITheme ``` |

# Members

| Member name | Description |
| --- | --- |
| Dark | Dark. |
| Light | Light. |

# See Also

Autodesk.Revit.UI Namespace